app/controllers/authentications_controller.rb

  def create

    # if current_user == nil
    #   #raise current_user.inspect
    #   logger.debug "qqqqqqqqqqqqqqqqq"
    #   logger.debug current_user
    # end
    omniauth = request.env["omniauth.auth"]
    authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])
    if authentication
      logger.debug "111111111111111111111111111111111111111111111111111111111"
      flash[:notice] = "Signed in successfully."
      sign_in_and_redirect(:user, authentication.user)
    elsif current_user
      logger.debug "222222222222222222222222222222222222222222222222222222222"
      current_user.authentications.create!(:provider => omniauth['provider'], :uid => omniauth['uid'])
---
SELECT `authentications`.* FROM `authentications` WHERE `authentications`.`uid` = '471261730' AND `authentications`.`provider` = 'twitter' LIMIT 1
INSERT INTO `authentications` (`created_at`, `provider`, `uid`, `updated_at`, `user_id`) VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 23 Jan 2012 18:34:27 UTC +00:00], ["provider", "twitter"], ["uid", "471261730"], ["updated_at", Mon, 23 Jan 2012 18:34:27 UTC +00:00], ["user_id", 2]]