app/controllers/pages_controller.rb

  def index
    if Page.all.blank?
---
SELECT `pages`.* FROM `pages`