app/controllers/products_controller.rb

  def show
    if !!resource.mtitle
      @title = resource.mtitle
    else
      @title = "#{resource.category.title} " + "#{resource.brand}"
    end
    prs = Product.with_image.where(category_id: resource.category_id).sample(10)
---
SELECT `products`.* FROM `products` WHERE `products`.`category_id` = 1 AND `products`.`id` = ? LIMIT 1  [["id", "1"]]